{
  "intents": [
    {
      "tag": "que_es_chip_m2m",
      "patterns": [
        "¿Qué es un chip M2M?",
        "¿Para qué sirve el chip M2M?",
        "Explícame qué es M2M",
        "No entiendo qué es el chip M2M"
      ],
      "responses": [
        "El chip M2M de BRCO es una tarjeta SIM especial para conectar dispositivos de forma remota y automática a través de redes móviles. Es ideal para GPS, POS, cámaras, sensores, alarmas y muchos otros dispositivos que necesitan estar conectados sin intervención humana."
      ]
    },
    {
      "tag": "diferencia_chip_normal_m2m",
      "patterns": [
        "¿Cuál es la diferencia entre un chip normal y un chip M2M?",
        "¿Qué diferencia hay con un chip común?",
        "¿Por qué usar M2M y no un chip normal?"
      ],
      "responses": [
        "A diferencia de un chip convencional de celular, el chip M2M está diseñado para mantenerse siempre conectado, moverse entre operadores (multicarrier), evitar bloqueos por inactividad, y ser gestionado de forma centralizada desde una plataforma web."
      ]
    },
    {
      "tag": "dispositivos_compatibles",
      "patterns": [
        "¿Qué dispositivos puedo conectar?",
        "¿Dónde se puede usar el chip?",
        "¿Qué equipos son compatibles?"
      ],
      "responses": [
        "Puedes usar nuestros chips en dispositivos como GPS vehiculares, cámaras IP, POS, sensores, alarmas, rastreadores de motos, medidores eléctricos o de agua, entre otros."
      ]
    },
    {
      "tag": "cobertura_funciona_donde",
      "patterns": [
        "¿Dónde funciona el chip?",
        "¿Tiene cobertura en todo el país?",
        "¿Funciona fuera de Perú?",
        "¿Funciona en mi ciudad?"
      ],
      "responses": [
        "El chip M2M funciona en varias redes móviles gracias a su tecnología multicarrier. En Perú, se conecta automáticamente a las principales operadoras. También funciona en países como Colombia, Chile, Ecuador y otros de la región."
      ]
    },
    {
      "tag": "precio_servicio",
      "patterns": [
        "¿Cuánto cuesta el servicio?",
        "¿Cuál es el precio del chip?",
        "¿Qué tarifas tienen?"
      ],
      "responses": [
        "Los precios varían según la cantidad de chips y el consumo mensual. ¿Cuántos dispositivos deseas conectar y en qué país estás? Con esa información te derivamos con un asesor para cotizarte."
      ]
    },
    {
      "tag": "prueba_servicio",
      "patterns": [
        "¿Puedo probar el chip?",
        "¿Tienen demo?",
        "¿Se puede hacer una prueba antes?"
      ],
      "responses": [
        "Sí, ofrecemos pruebas comerciales. Podemos enviarte un chip demo para que lo pruebes antes de tomar una decisión. ¿Deseas que te contacte un asesor para coordinar?"
      ]
    },
    {
      "tag": "administrar_servicio",
      "patterns": [
        "¿Cómo administro mis chips?",
        "¿Tienen plataforma?",
        "¿Puedo ver el consumo?",
        "¿Cómo se controla el uso?"
      ],
      "responses": [
        "Contamos con una plataforma web donde puedes ver en tiempo real el estado de tus chips, el consumo de datos, establecer límites, recibir alertas y más. Es muy útil para controlar todos tus dispositivos conectados."
      ]
    },
    {
      "tag": "redes_soportadas",
      "patterns": [
        "¿Qué redes usan los chips?",
        "¿A qué operador se conecta?",
        "¿Solo funciona con Claro o Movistar?"
      ],
      "responses": [
        "Nuestros chips se conectan automáticamente a la mejor red disponible en la zona, entre las principales operadoras móviles del país. No estás atado a una sola empresa."
      ]
    },
    {
      "tag": "planes_disponibles",
      "patterns": [
        "¿Qué planes tienen?",
        "¿Cuántos megas puedo usar?",
        "¿Tienen planes ilimitados?"
      ],
      "responses": [
        "Ofrecemos planes flexibles que van desde 50 MB hasta más de 1 GB por chip, según el tipo de dispositivo y necesidad. ¿Qué tipo de dispositivos estás conectando y cuántos serían? Así te ayudamos mejor."
      ]
    },
    {
      "tag": "soporte_tecnico",
      "patterns": [
        "¿Tienen soporte técnico?",
        "¿Me pueden ayudar si algo falla?",
        "¿Cómo contacto soporte?"
      ],
      "responses": [
        "Sí, contamos con soporte técnico y asesoría comercial. Si tienes un inconveniente o deseas ayuda, dime y te derivaré con el equipo adecuado."
      ]
    },
    {
      "tag": "api_integracion",
      "patterns": [
        "¿Puedo integrar con mi sistema?",
        "¿Tienen API?",
        "¿Hay forma de automatizar la gestión?"
      ],
      "responses": [
        "Sí, nuestra plataforma ofrece una API para que puedas integrarla a tus propios sistemas y gestionar tus chips de forma automática. Si deseas más detalles técnicos, te puedo poner en contacto con nuestro equipo."
      ]
    },
    {
      "tag": "como_contratar",
      "patterns": [
        "¿Cómo contrato?",
        "¿Dónde se compra el chip?",
        "Quiero adquirir chips"
      ],
      "responses": [
        "Para contratar, necesitamos saber cuántos chips necesitas, en qué país y con qué dispositivos. Con esa información te derivamos a un asesor que te guiará en todo el proceso de activación y facturación."
      ]
    },
    {
      "tag": "derivacion_asesor",
      "patterns": [
        "Quiero hablar con un asesor",
        "Necesito una cotización",
        "Tengo dudas técnicas",
        "¿Me pueden llamar?"
      ],
      "responses": [
        "Entiendo. Para ayudarte mejor, te pondré en contacto con un asesor especializado de BRCO. En breve se comunicarán contigo."
      ]
    },
    {
      "tag": "cliente_interesado",
      "patterns": [
        "Cómo puedo adquirir su servicio",
        "Podría comunicarme con un asesor",
        "Quiero hablar con alguien",
        "¿Tienen asesor comercial?",
        "¿Cómo contrato?",
        "Podría agendarme una reunión",
        "Quiero agendar una reunión"
      ],
      "responses": [
        "Puedes agendar una reunión con nuestro equipo aquí: https://meetings.hubspot.com/angel40"
      ]
    }
  ]
}
